vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1173_DFP.pdsc
    <condition id="allOf.board=evkbmimxrt1170, driver.flexspi, device=MIMXRT1173.internal_condition">
      <require condition="board.evkbmimxrt1170.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexspi"/>
      <require condition="device.MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="component.gpt_adapter.condition_id">
      <require condition="allOf.driver.gpt, device=MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="allOf.driver.gpt, device=MIMXRT1173.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpt"/>
      <require condition="device.MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="component.gpt_time_stamp_adapter.condition_id">
      <require condition="allOf.driver.gpt, device=MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="component.i2c_adapter_interface.condition_id">
      <require condition="allOf.anyOf=allOf=anyOf=driver.lpi2c, component.lpi2c_adapter, device=MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=anyOf=driver.lpi2c, component.lpi2c_adapter, device=MIMXRT1173.internal_condition">
      <require condition="anyOf.allOf=anyOf=driver.lpi2c, component.lpi2c_adapter.internal_condition"/>
      <require condition="device.MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=anyOf=driver.lpi2c, component.lpi2c_adapter.internal_condition">
      <accept condition="allOf.anyOf=driver.lpi2c, component.lpi2c_adapter.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.lpi2c, component.lpi2c_adapter.internal_condition">
      <require condition="anyOf.driver.lpi2c.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpi2c_adapter"/>
    </condition>
    <condition id="anyOf.driver.lpi2c.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
    </condition>
    <condition id="component.i2c_mux.condition_id">
      <require condition="allOf.device=MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="component.i2c_mux_pca954x.condition_id">
      <require condition="allOf.component.i2c_mux, device=MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="allOf.component.i2c_mux, device=MIMXRT1173.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_mux"/>
      <require condition="device.MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="component.igpio_adapter.condition_id">
      <require condition="allOf.driver.igpio, device=MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="allOf.driver.igpio, device=MIMXRT1173.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require condition="device.MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="component.led.condition_id">
      <require condition="allOf.anyOf=allOf=component.igpio_adapter, driver.igpio, component.timer_manager, driver.common, device=MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.igpio_adapter, driver.igpio, component.timer_manager, driver.common, device=MIMXRT1173.internal_condition">
      <require condition="anyOf.allOf=component.igpio_adapter, driver.igpio.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="timer_manager"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="component.lists.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="component.log.condition_id">
      <require condition="allOf.driver.common, utility.str, device=MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, utility.str, device=MIMXRT1173.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="str"/>
      <require condition="device.MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="component.log.backend.debug_console.condition_id">
      <require condition="allOf.component.log, driver.common, utility.debug_console, device=MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="allOf.component.log, driver.common, utility.debug_console, device=MIMXRT1173.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="log"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require condition="device.MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="component.log.backend.debug_console_lite.condition_id">
      <require condition="allOf.component.log, driver.common, utility.debug_console_lite, device=MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="allOf.component.log, driver.common, utility.debug_console_lite, device=MIMXRT1173.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="log"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite"/>
      <require condition="device.MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="component.log.backend.ringbuffer.condition_id">
      <require condition="allOf.component.log, driver.common, device=MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="allOf.component.log, driver.common, device=MIMXRT1173.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="log"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MIMXRT1173.internal_condition"/>
    </condition>
