vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1173_DFP.pdsc
    <condition id="component.lpi2c_adapter.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, component.i2c_adapter_interface, device=MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.lpi2c, component.i2c_adapter_interface, device=MIMXRT1173.internal_condition">
      <require condition="anyOf.driver.lpi2c.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_adapter_interface"/>
      <require condition="device.MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="component.lpspi_adapter.condition_id">
      <require condition="allOf.driver.common, driver.lpspi, device=MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.lpspi, device=MIMXRT1173.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi"/>
      <require condition="device.MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="component.lpuart_adapter.condition_id">
      <require condition="allOf.anyOf=driver.lpuart, device=MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.lpuart, device=MIMXRT1173.internal_condition">
      <require condition="anyOf.driver.lpuart.internal_condition"/>
      <require condition="device.MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.lpuart.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
    </condition>
    <condition id="component.lpuart_dma_adapter.condition_id">
      <require condition="allOf.anyOf=driver.edma, component.lpuart_adapter, component.timer_manager, driver.lpuart, device=MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma, component.lpuart_adapter, component.timer_manager, driver.lpuart, device=MIMXRT1173.internal_condition">
      <require condition="anyOf.driver.edma.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="timer_manager"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require condition="device.MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.edma.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
    </condition>
    <condition id="component.mcxw_flash_adapter.condition_id">
      <require condition="allOf.driver.romapi, device=MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="allOf.driver.romapi, device=MIMXRT1173.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="romapi"/>
      <require condition="device.MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="component.mem_manager.condition_id">
      <require condition="allOf.anyOf=component.mem_manager_legacy, component.mem_manager_light, component.lists, device=MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=component.mem_manager_legacy, component.mem_manager_light, component.lists, device=MIMXRT1173.internal_condition">
      <require condition="anyOf.component.mem_manager_legacy, component.mem_manager_light.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require condition="device.MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="anyOf.component.mem_manager_legacy, component.mem_manager_light.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="mem_manager_legacy"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="mem_manager_light"/>
    </condition>
    <condition id="component.mem_manager_legacy.condition_id">
      <require condition="allOf.component.mem_manager, device=MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="allOf.component.mem_manager, device=MIMXRT1173.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mem_manager"/>
      <require condition="device.MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="component.mem_manager_light.condition_id">
      <require condition="allOf.component.mem_manager, device=MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="component.mflash_offchip.condition_id">
      <require condition="allOf.anyOf=driver.cache_armv7_m7, driver.cache_lmem, driver.flexspi, driver.romapi, device=MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.cache_armv7_m7, driver.cache_lmem, driver.flexspi, driver.romapi, device=MIMXRT1173.internal_condition">
      <require condition="anyOf.driver.cache_armv7_m7, driver.cache_lmem, driver.flexspi, driver.romapi.internal_condition"/>
      <require condition="device.MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.cache_armv7_m7, driver.cache_lmem, driver.flexspi, driver.romapi.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="cache_armv7_m7"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="cache_lmem"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="flexspi"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="romapi"/>
    </condition>
    <condition id="allOf.boards=evkbmimxrt1170.condition_id">
      <require condition="boards.evkbmimxrt1170.internal_condition"/>
    </condition>
    <condition id="boards.evkbmimxrt1170.internal_condition">
      <accept condition="device.MIMXRT1171.internal_condition"/>
      <accept condition="device.MIMXRT1172.internal_condition"/>
      <accept condition="device.MIMXRT1173.internal_condition"/>
      <accept condition="device.MIMXRT1175.internal_condition"/>
      <accept condition="device.MIMXRT1176.internal_condition"/>
    </condition>
