vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1173_DFP.pdsc
    <condition id="driver.fxls8974cf.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="driver.fxos8700cq.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="driver.gpc_xxx_ctrl.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="driver.gpt.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1173xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.gt911.condition_id">
      <require condition="allOf.device=MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="driver.htu21d.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="driver.icm42688p.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="driver.iee.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1173xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.iee_apc.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1173xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.igpio.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1173xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.ili9341.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="driver.iomuxc.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="driver.key_manager.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1173xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.kpp.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1173xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.lcdifv2.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1173xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.lpadc.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1173xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.lpi2c.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1173xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.lpi2c_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma, driver.lpi2c, device=MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma, driver.lpi2c, device=MIMXRT1173.internal_condition">
      <require condition="anyOf.driver.edma.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require condition="device.MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="driver.lpspi.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1173xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.lpspi_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma, driver.lpspi, device=MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma, driver.lpspi, device=MIMXRT1173.internal_condition">
      <require condition="anyOf.driver.edma.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi"/>
      <require condition="device.MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="driver.lpuart.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1173xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.lpuart_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma, driver.lpuart, device=MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma, driver.lpuart, device=MIMXRT1173.internal_condition">
      <require condition="anyOf.driver.edma.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require condition="device.MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="driver.lsm6dso.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="driver.max30101.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="driver.mecc.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1173xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.memory.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="driver.mipi_csi2rx.condition_id">
      <require condition="allOf.driver.common, driver.mipi_csi2rx_soc, device_id=MIMXRT1173xxxxx.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.mipi_csi2rx_soc, device_id=MIMXRT1173xxxxx.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="soc_mipi_csi2rx"/>
      <require condition="device_id.MIMXRT1173xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.mipi_csi2rx_soc.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="driver.mipi_dsi_soc.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="driver.mipi_dsi_split.condition_id">
      <require condition="allOf.driver.common, driver.mipi_csi2rx_soc, driver.mipi_dsi_soc, device_id=MIMXRT1173xxxxx.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.mipi_csi2rx_soc, driver.mipi_dsi_soc, device_id=MIMXRT1173xxxxx.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="soc_mipi_csi2rx"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="soc_mipi_dsi"/>
      <require condition="device_id.MIMXRT1173xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.mma8451q.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="driver.mma8652fc.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="driver.mu.condition_id">
      <require condition="allOf.driver.common, device_id=MIMXRT1173xxxxx.internal_condition"/>
    </condition>
    <condition id="driver.mx25r_flash.condition_id">
      <require condition="allOf.device=MIMXRT1173.internal_condition"/>
    </condition>
    <condition id="driver.nic301.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT1173.internal_condition"/>
    </condition>
