vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1173_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="MIMXRT1173_linker" Cversion="1.0.0" condition="device.linker.condition_id">
      <description>Device MIMXRT1173_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, cores=cm4f, device_ids=MIMXRT1173xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1173/arm/MIMXRT1173xxxxx_cm4_flexspi_nor.scf" version="1.0.0" projectpath="MIMXRT1173/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm4f, device_ids=MIMXRT1173xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1173/arm/MIMXRT1173xxxxx_cm4_flexspi_nor_sdram.scf" version="1.0.0" projectpath="MIMXRT1173/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm4f, device_ids=MIMXRT1173xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1173/arm/MIMXRT1173xxxxx_cm4_ram.scf" version="1.0.0" projectpath="MIMXRT1173/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm4f, device_ids=MIMXRT1173xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1173/arm/MIMXRT1173xxxxx_cm4_sdram.scf" version="1.0.0" projectpath="MIMXRT1173/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm4f, device_ids=MIMXRT1173xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1173/arm/MIMXRT1173xxxxx_cm4_sdram_txt.scf" version="1.0.0" projectpath="MIMXRT1173/arm"/>
        <file condition="allOf.toolchains=armgcc, cores=cm4f, device_ids=MIMXRT1173xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1173/gcc/MIMXRT1173xxxxx_cm4_flexspi_nor.ld" version="1.0.0" projectpath="MIMXRT1173/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm4f, device_ids=MIMXRT1173xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1173/gcc/MIMXRT1173xxxxx_cm4_flexspi_nor_sdram.ld" version="1.0.0" projectpath="MIMXRT1173/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm4f, device_ids=MIMXRT1173xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1173/gcc/MIMXRT1173xxxxx_cm4_ram.ld" version="1.0.0" projectpath="MIMXRT1173/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm4f, device_ids=MIMXRT1173xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1173/gcc/MIMXRT1173xxxxx_cm4_sdram.ld" version="1.0.0" projectpath="MIMXRT1173/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm4f, device_ids=MIMXRT1173xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1173/gcc/MIMXRT1173xxxxx_cm4_sdram_txt.ld" version="1.0.0" projectpath="MIMXRT1173/gcc"/>
        <file condition="allOf.toolchains=iar, cores=cm4f, device_ids=MIMXRT1173xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1173/iar/MIMXRT1173xxxxx_cm4_flexspi_nor.icf" version="1.0.0" projectpath="MIMXRT1173/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm4f, device_ids=MIMXRT1173xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1173/iar/MIMXRT1173xxxxx_cm4_flexspi_nor_sdram.icf" version="1.0.0" projectpath="MIMXRT1173/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm4f, device_ids=MIMXRT1173xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1173/iar/MIMXRT1173xxxxx_cm4_ram.icf" version="1.0.0" projectpath="MIMXRT1173/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm4f, device_ids=MIMXRT1173xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1173/iar/MIMXRT1173xxxxx_cm4_sdram.icf" version="1.0.0" projectpath="MIMXRT1173/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm4f, device_ids=MIMXRT1173xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1173/iar/MIMXRT1173xxxxx_cm4_sdram_txt.icf" version="1.0.0" projectpath="MIMXRT1173/iar"/>
        <file condition="allOf.toolchains=mdk, cores=cm7f, device_ids=MIMXRT1173xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1173/arm/MIMXRT1173xxxxx_cm7_flexspi_nor.scf" version="1.0.0" projectpath="MIMXRT1173/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm7f, device_ids=MIMXRT1173xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1173/arm/MIMXRT1173xxxxx_cm7_flexspi_nor_sdram.scf" version="1.0.0" projectpath="MIMXRT1173/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm7f, device_ids=MIMXRT1173xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1173/arm/MIMXRT1173xxxxx_cm7_ram.scf" version="1.0.0" projectpath="MIMXRT1173/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm7f, device_ids=MIMXRT1173xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1173/arm/MIMXRT1173xxxxx_cm7_sdram.scf" version="1.0.0" projectpath="MIMXRT1173/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm7f, device_ids=MIMXRT1173xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1173/arm/MIMXRT1173xxxxx_cm7_sdram_txt.scf" version="1.0.0" projectpath="MIMXRT1173/arm"/>
        <file condition="allOf.toolchains=armgcc, cores=cm7f, device_ids=MIMXRT1173xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1173/gcc/MIMXRT1173xxxxx_cm7_flexspi_nor.ld" version="1.0.0" projectpath="MIMXRT1173/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm7f, device_ids=MIMXRT1173xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1173/gcc/MIMXRT1173xxxxx_cm7_flexspi_nor_sdram.ld" version="1.0.0" projectpath="MIMXRT1173/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm7f, device_ids=MIMXRT1173xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1173/gcc/MIMXRT1173xxxxx_cm7_ram.ld" version="1.0.0" projectpath="MIMXRT1173/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm7f, device_ids=MIMXRT1173xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1173/gcc/MIMXRT1173xxxxx_cm7_sdram.ld" version="1.0.0" projectpath="MIMXRT1173/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm7f, device_ids=MIMXRT1173xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1173/gcc/MIMXRT1173xxxxx_cm7_sdram_txt.ld" version="1.0.0" projectpath="MIMXRT1173/gcc"/>
        <file condition="allOf.toolchains=iar, cores=cm7f, device_ids=MIMXRT1173xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1173/iar/MIMXRT1173xxxxx_cm7_flexspi_nor.icf" version="1.0.0" projectpath="MIMXRT1173/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm7f, device_ids=MIMXRT1173xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1173/iar/MIMXRT1173xxxxx_cm7_flexspi_nor_sdram.icf" version="1.0.0" projectpath="MIMXRT1173/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm7f, device_ids=MIMXRT1173xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1173/iar/MIMXRT1173xxxxx_cm7_ram.icf" version="1.0.0" projectpath="MIMXRT1173/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm7f, device_ids=MIMXRT1173xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1173/iar/MIMXRT1173xxxxx_cm7_sdram.icf" version="1.0.0" projectpath="MIMXRT1173/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm7f, device_ids=MIMXRT1173xxxxx.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT1173/iar/MIMXRT1173xxxxx_cm7_sdram_txt.icf" version="1.0.0" projectpath="MIMXRT1173/iar"/>
      </files>
    </component>
