vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1173_DFP.pdsc
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MIMXRT1173" Cversion="1.0.0" condition="device.project_template.condition_id" isDefaultVariant="1">
      <description>Devices_project_template MIMXRT1173</description>
      <files>
        <file category="header" attr="config" name="devices/MIMXRT1173/project_template/board.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT1173/project_template/board.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MIMXRT1173/project_template/clock_config.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT1173/project_template/clock_config.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MIMXRT1173/project_template/pin_mux.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT1173/project_template/pin_mux.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MIMXRT1173/project_template/peripherals.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT1173/project_template/peripherals.c" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MIMXRT1173/project_template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="" Cversion="1.0.0" condition="device.startup.condition_id">
      <description>Device MIMXRT1173_startup</description>
      <files>
        <file condition="allOf.toolchains=iar, core_ids=cm4.condition_id" category="sourceAsm" attr="config" name="devices/MIMXRT1173/iar/startup_MIMXRT1173_cm4.s" version="1.0.0" projectpath="startup/iar"/>
        <file condition="allOf.toolchains=armgcc, core_ids=cm4.condition_id" category="sourceAsm" attr="config" name="devices/MIMXRT1173/gcc/startup_MIMXRT1173_cm4.S" version="1.0.0" projectpath="startup/gcc"/>
        <file condition="allOf.toolchains=mdk, core_ids=cm4.condition_id" category="sourceAsm" attr="config" name="devices/MIMXRT1173/arm/startup_MIMXRT1173_cm4.S" version="1.0.0" projectpath="startup/arm"/>
        <file condition="allOf.toolchains=iar, core_ids=cm7.condition_id" category="sourceAsm" attr="config" name="devices/MIMXRT1173/iar/startup_MIMXRT1173_cm7.s" version="1.0.0" projectpath="startup/iar"/>
        <file condition="allOf.toolchains=armgcc, core_ids=cm7.condition_id" category="sourceAsm" attr="config" name="devices/MIMXRT1173/gcc/startup_MIMXRT1173_cm7.S" version="1.0.0" projectpath="startup/gcc"/>
        <file condition="allOf.toolchains=mdk, core_ids=cm7.condition_id" category="sourceAsm" attr="config" name="devices/MIMXRT1173/arm/startup_MIMXRT1173_cm7.S" version="1.0.0" projectpath="startup/arm"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MIMXRT1173_system" Cversion="1.0.0" condition="device.system.condition_id">
      <description>Device MIMXRT1173_system</description>
      <files>
        <file condition="allOf.core_ids=cm4.condition_id" category="sourceC" name="devices/MIMXRT1173/system_MIMXRT1173_cm4.c" projectpath="device"/>
        <file condition="allOf.core_ids=cm4.condition_id" category="header" name="devices/MIMXRT1173/system_MIMXRT1173_cm4.h" projectpath="device"/>
        <file condition="allOf.core_ids=cm7.condition_id" category="sourceC" name="devices/MIMXRT1173/system_MIMXRT1173_cm7.c" projectpath="device"/>
        <file condition="allOf.core_ids=cm7.condition_id" category="header" name="devices/MIMXRT1173/system_MIMXRT1173_cm7.h" projectpath="device"/>
        <file category="include" name="devices/MIMXRT1173/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="acmp" Cversion="2.3.0" condition="driver.acmp.condition_id">
      <description>ACMP Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1173/drivers/fsl_acmp.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1173/drivers/fsl_acmp.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1173/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="adc_etc" Cversion="2.3.2" condition="driver.adc_etc.condition_id">
      <description>ADC_ETC Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1173/drivers/fsl_adc_etc.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1173/drivers/fsl_adc_etc.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1173/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ak4497" Cversion="2.1.2" condition="driver.ak4497.condition_id">
      <description>Driver ak4497</description>
      <RTE_Components_h>
#ifndef CODEC_AK4497_ENABLE
#define CODEC_AK4497_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/ak4497/fsl_ak4497.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/ak4497/fsl_ak4497.c" projectpath="codec"/>
        <file category="include" name="components/codec/ak4497/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pmu_1" Cversion="2.1.2" condition="driver.anadig_pmu.condition_id">
      <description>PMU Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1173/drivers/fsl_pmu.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1173/drivers/fsl_pmu.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1173/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="anatop_ai" Cversion="1.0.0" condition="driver.anatop_ai.condition_id">
      <description>ANATOP AI Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1173/drivers/fsl_anatop_ai.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1173/drivers/fsl_anatop_ai.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1173/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="aoi" Cversion="2.0.2" condition="driver.aoi.condition_id">
      <description>AOI Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1173/drivers/fsl_aoi.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1173/drivers/fsl_aoi.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1173/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="asrc" Cversion="2.1.3" condition="driver.asrc.condition_id">
      <description>asrc Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1173/drivers/fsl_asrc.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1173/drivers/fsl_asrc.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1173/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="asrc_edma" Cversion="2.2.0" condition="driver.asrc_edma.condition_id">
      <description>asrc_edma Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1173/drivers/fsl_asrc_edma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1173/drivers/fsl_asrc_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1173/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="caam" Cversion="2.4.0" condition="driver.caam.condition_id">
      <description>CAAM Driver</description>
      <RTE_Components_h>
        #ifndef CRYPTO_USE_DRIVER_CAAM
        #define CRYPTO_USE_DRIVER_CAAM
        #endif
        #ifndef CACHE_MODE_WRITE_THROUGH
        #define CACHE_MODE_WRITE_THROUGH 1
        #endif
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="devices/MIMXRT1173/drivers/fsl_caam.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1173/drivers/fsl_caam.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1173/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cache_armv7_m7" Cversion="2.0.4" condition="driver.cache_armv7_m7.condition_id">
      <description>CACHE Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1173/drivers/cm7/fsl_cache.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1173/drivers/cm7/fsl_cache.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1173/drivers/cm7/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cache_lmem" Cversion="2.1.0" condition="driver.cache_lmem.condition_id">
      <description>CACHE LMEM Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1173/drivers/cm4/fsl_cache.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1173/drivers/cm4/fsl_cache.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1173/drivers/cm4/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-common" Cversion="1.0.0" condition="driver.camera-common.condition_id">
      <description>Driver camera-common</description>
      <files>
        <file category="header" name="components/video/camera/fsl_camera.h" projectpath="video"/>
        <file category="include" name="components/video/camera/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-ap1302" Cversion="1.0.1" condition="driver.camera-device-ap1302.condition_id">
      <description>Driver camera-device-ap1302</description>
      <files>
        <file category="header" name="components/video/camera/device/ap1302/fsl_ap1302.h" projectpath="video"/>
        <file category="sourceC" name="components/video/camera/device/ap1302/fsl_ap1302.c" projectpath="video"/>
        <file category="include" name="components/video/camera/device/ap1302/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-common" Cversion="1.0.0" condition="driver.camera-device-common.condition_id">
      <description>Driver camera-device-common</description>
      <files>
        <file category="header" name="components/video/camera/device/fsl_camera_device.h" projectpath="video"/>
        <file category="include" name="components/video/camera/device/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-max9286" Cversion="1.0.2" condition="driver.camera-device-max9286.condition_id">
      <description>Driver camera-device-max9286</description>
      <files>
        <file category="header" name="components/video/camera/device/max9286/fsl_max9286.h" projectpath="video"/>
        <file category="sourceC" name="components/video/camera/device/max9286/fsl_max9286.c" projectpath="video"/>
        <file category="include" name="components/video/camera/device/max9286/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-mt9m114" Cversion="1.0.2" condition="driver.camera-device-mt9m114.condition_id">
      <description>Driver camera-device-mt9m114</description>
      <files>
        <file category="header" name="components/video/camera/device/mt9m114/fsl_mt9m114.h" projectpath="video"/>
        <file category="sourceC" name="components/video/camera/device/mt9m114/fsl_mt9m114.c" projectpath="video"/>
        <file category="include" name="components/video/camera/device/mt9m114/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-ov5640" Cversion="1.0.1" condition="driver.camera-device-ov5640.condition_id">
      <description>Driver camera-device-ov5640</description>
      <files>
        <file category="header" name="components/video/camera/device/ov5640/fsl_ov5640.h" projectpath="video"/>
        <file category="sourceC" name="components/video/camera/device/ov5640/fsl_ov5640.c" projectpath="video"/>
        <file category="include" name="components/video/camera/device/ov5640/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="camera-device-ov7670" Cversion="1.0.2" condition="driver.camera-device-ov7670.condition_id">
      <description>Driver camera-device-ov7670</description>
      <files>
        <file category="header" name="components/video/camera/device/ov7670/fsl_ov7670.h" projectpath="video"/>
        <file category="sourceC" name="components/video/camera/device/ov7670/fsl_ov7670.c" projectpath="video"/>
        <file category="include" name="components/video/camera/device/ov7670/"/>
      </files>
    </component>
