vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1173_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_i2s_edma" Cversion="2.1.8" condition="driver.flexio_i2s_edma.condition_id">
      <description>FLEXIO I2S EDMA Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1173/drivers/fsl_flexio_i2s_edma.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1173/drivers/fsl_flexio_i2s_edma.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1173/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_spi" Cversion="2.4.3" condition="driver.flexio_spi.condition_id">
      <description>FLEXIO SPI Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1173/drivers/fsl_flexio_spi.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1173/drivers/fsl_flexio_spi.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1173/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_spi_edma" Cversion="2.3.0" condition="driver.flexio_spi_edma.condition_id">
      <description>FLEXIO SPI EDMA Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1173/drivers/fsl_flexio_spi_edma.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1173/drivers/fsl_flexio_spi_edma.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1173/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_uart" Cversion="2.6.4" condition="driver.flexio_uart.condition_id">
      <description>FLEXIO UART Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1173/drivers/fsl_flexio_uart.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1173/drivers/fsl_flexio_uart.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1173/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_uart_edma" Cversion="2.4.1" condition="driver.flexio_uart_edma.condition_id">
      <description>FLEXIO UART EDMA Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1173/drivers/fsl_flexio_uart_edma.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1173/drivers/fsl_flexio_uart_edma.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1173/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexram" Cversion="2.3.0" condition="driver.flexram.condition_id">
      <description>FLEXRAM Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1173/drivers/fsl_flexram.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1173/drivers/fsl_flexram.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1173/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="soc_flexram_allocate" Cversion="2.0.2" condition="driver.flexram_allocate.condition_id">
      <description>SOC FLEXRAM ALLOCATE Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1173/drivers/fsl_flexram_allocate.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1173/drivers/fsl_flexram_allocate.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1173/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexspi" Cversion="2.8.0" condition="driver.flexspi.condition_id">
      <description>FLEXSPI Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1173/drivers/fsl_flexspi.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1173/drivers/fsl_flexspi.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1173/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexspi_edma" Cversion="2.3.3" condition="driver.flexspi_edma.condition_id">
      <description>FLEXSPI Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1173/drivers/fsl_flexspi_edma.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1173/drivers/fsl_flexspi_edma.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1173/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ft3267" Cversion="1.0.1" condition="driver.ft3267.condition_id">
      <description>Touch panel controller FT3267 driver</description>
      <files>
        <file category="header" name="components/touch/ft3267/fsl_ft3267.h" projectpath="touchpanel"/>
        <file category="sourceC" name="components/touch/ft3267/fsl_ft3267.c" projectpath="touchpanel"/>
        <file category="include" name="components/touch/ft3267/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ft5406" Cversion="1.0.0" condition="driver.ft5406.condition_id">
      <description>Driver ft5406</description>
      <files>
        <file category="header" name="components/touch/ft5406/fsl_ft5406.h" projectpath="touchpanel"/>
        <file category="sourceC" name="components/touch/ft5406/fsl_ft5406.c" projectpath="touchpanel"/>
        <file category="include" name="components/touch/ft5406/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ft5406_rt" Cversion="1.0.0" condition="driver.ft5406_rt.condition_id">
      <description>Driver ft5406_rt</description>
      <files>
        <file category="header" name="components/touch/ft5406_rt/fsl_ft5406_rt.h" projectpath="touchpanel"/>
        <file category="sourceC" name="components/touch/ft5406_rt/fsl_ft5406_rt.c" projectpath="touchpanel"/>
        <file category="include" name="components/touch/ft5406_rt/"/>
      </files>
    </component>
