vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT1173_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="p3t1755" Cversion="2.0.0" condition="driver.p3t1755.condition_id">
      <description>Driver p3t1755</description>
      <files>
        <file category="header" name="components/sensor/p3t1755/fsl_p3t1755.h" projectpath="component/p3t1755"/>
        <file category="sourceC" name="components/sensor/p3t1755/fsl_p3t1755.c" projectpath="component/p3t1755"/>
        <file category="include" name="components/sensor/p3t1755/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pcm186x" Cversion="2.0.1" condition="driver.pcm186x.condition_id">
      <description>Driver pcm186x</description>
      <RTE_Components_h>
#ifndef CODEC_PCM186X_ENABLE
#define CODEC_PCM186X_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/pcm186x/fsl_pcm186x.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/pcm186x/fsl_pcm186x.c" projectpath="codec"/>
        <file category="include" name="components/codec/pcm186x/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pcm512x" Cversion="2.0.1" condition="driver.pcm512x.condition_id">
      <description>Driver pcm512x</description>
      <RTE_Components_h>
#ifndef CODEC_PCM512X_ENABLE
#define CODEC_PCM512X_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/pcm512x/fsl_pcm512x.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/pcm512x/fsl_pcm512x.c" projectpath="codec"/>
        <file category="include" name="components/codec/pcm512x/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pdm" Cversion="2.9.3" condition="driver.pdm.condition_id">
      <description>PDM Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1173/drivers/fsl_pdm.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1173/drivers/fsl_pdm.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1173/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pdm_edma" Cversion="2.6.4" condition="driver.pdm_edma.condition_id">
      <description>PDM EDMA Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1173/drivers/fsl_pdm_edma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1173/drivers/fsl_pdm_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1173/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pf1550" Cversion="1.0.0" condition="driver.pf1550.condition_id">
      <description>Driver pf1550</description>
      <files>
        <file category="sourceC" name="components/pmic/pf1550/fsl_pf1550.c" projectpath="component/pmic/pf1550"/>
        <file category="header" name="components/pmic/pf1550/fsl_pf1550.h" projectpath="component/pmic/pf1550"/>
        <file category="sourceC" name="components/pmic/pf1550/fsl_pf1550_charger.c" projectpath="component/pmic/pf1550"/>
        <file category="header" name="components/pmic/pf1550/fsl_pf1550_charger.h" projectpath="component/pmic/pf1550"/>
        <file category="include" name="components/pmic/pf1550/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pf3000" Cversion="1.0.0" condition="driver.pf3000.condition_id">
      <description>Driver pf3000</description>
      <files>
        <file category="sourceC" name="components/pmic/pf3000/fsl_pf3000.c" projectpath="component/pmic/pf3000"/>
        <file category="header" name="components/pmic/pf3000/fsl_pf3000.h" projectpath="component/pmic/pf3000"/>
        <file category="include" name="components/pmic/pf3000/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pf5020" Cversion="2.0.0" condition="driver.pf5020.condition_id">
      <description>Driver pf5020</description>
      <files>
        <file category="sourceC" name="components/pmic/pf5020/fsl_pf5020.c" projectpath="component/pmic/pf5020"/>
        <file category="header" name="components/pmic/pf5020/fsl_pf5020.h" projectpath="component/pmic/pf5020"/>
        <file category="include" name="components/pmic/pf5020/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pgmc" Cversion="2.1.2" condition="driver.pgmc.condition_id">
      <description>PGMC Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1173/drivers/fsl_pgmc.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1173/drivers/fsl_pgmc.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1173/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pit" Cversion="2.2.0" condition="driver.pit.condition_id">
      <description>PIT Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1173/drivers/fsl_pit.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1173/drivers/fsl_pit.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1173/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="psp27801" Cversion="1.0.0" condition="driver.psp27801.condition_id">
      <description>Driver psp27801</description>
      <files>
        <file category="header" name="components/display/psp27801/fsl_psp27801.h" projectpath="oled"/>
        <file category="sourceC" name="components/display/psp27801/fsl_psp27801.c" projectpath="oled"/>
        <file category="include" name="components/display/psp27801/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="PUF" Cversion="2.2.0" condition="driver.puf.condition_id">
      <description>PUF Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1173/drivers/fsl_puf.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1173/drivers/fsl_puf.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1173/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pwm" Cversion="2.9.0" condition="driver.pwm.condition_id">
      <description>PWM Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1173/drivers/fsl_pwm.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1173/drivers/fsl_pwm.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1173/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="pxp" Cversion="2.7.0" condition="driver.pxp.condition_id">
      <description>PXP Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1173/drivers/fsl_pxp.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1173/drivers/fsl_pxp.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1173/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="qtmr" Cversion="2.3.0" condition="driver.qtmr_1.condition_id">
      <description>QTMR Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1173/drivers/fsl_qtmr.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1173/drivers/fsl_qtmr.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1173/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rdc" Cversion="2.2.0" condition="driver.rdc.condition_id">
      <description>RDC Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1173/drivers/fsl_rdc.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1173/drivers/fsl_rdc.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1173/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rdc_sema42" Cversion="2.0.5" condition="driver.rdc_sema42.condition_id">
      <description>RDC SEMA42 Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1173/drivers/fsl_rdc_sema42.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1173/drivers/fsl_rdc_sema42.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1173/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="romapi" Cversion="1.1.1" condition="driver.romapi.condition_id">
      <description>ROMAPI Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT1173/drivers/fsl_romapi.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT1173/drivers/fsl_romapi.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1173/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rtwdog" Cversion="2.1.4" condition="driver.rtwdog.condition_id">
      <description>RTWDOG Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1173/drivers/fsl_rtwdog.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1173/drivers/fsl_rtwdog.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1173/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sai" Cversion="2.4.8" condition="driver.sai.condition_id">
      <description>SAI Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1173/drivers/fsl_sai.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1173/drivers/fsl_sai.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1173/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="sai_edma" Cversion="2.7.3" condition="driver.sai_edma.condition_id">
      <description>SAI EDMA Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT1173/drivers/fsl_sai_edma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT1173/drivers/fsl_sai_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT1173/drivers/"/>
      </files>
    </component>
